'''问卷'''
import streamlit as st

d = {
    '吴宗霖': '0162',
    '粟周天': '0244',
    '王博泉': '0361',
    '沈方捷': '0486',
    '杨澍弢': '0506',
    '张天一': '0648',
    '裴景焜': '0793',
    '宗文赫': '0857',
    '王熠朵': '0974',
    '朱君道': '1032',
    '董屹': '1117',
    '彭未初': '1280',
    '古辰浩': '1345',
    '胡元衡': '1488',
    '李睿宸': '1589',
    '张铭轩': '1692',
    '汪晓阳': '1775',
    '熊斐荃': '1872',
    '杨越淇': '1982',
    '邓子琪': '2026',
    '易宇辰': '2145',
    '郑宇航': '2229',
    '焦洛其': '2326',
    '刘小涵': '2464',
    '熊子谦': '2557',
    '吴美霖': '2640',
}
l = [x for x in d]

st.write(':orange[有奖小问卷]')
st.write('————————————————————————————————————————')
name = st.selectbox(':red[我是: ]', l)
password = st.text_input(':red[我的密码：]', '')
st.write('————————————————————————————————————————')
q1 = st.text_input('1.你喜欢编程吗？（没感觉/还行/有点意思/喜欢/很感兴趣）', '') + '\n'

q2 = st.text_input('2.如果喜欢的话，觉得哪里最有趣？', '') + '\n'

q3 = st.text_input('3.你觉得编程和人们的日常生活有关系吗？（没关系/可能有吧/有一些/关系很大/不知道）', '') + '\n'

q4 = st.text_input('4.编程有对你的学习、生活带来帮助或者影响吗', '') + '\n'

q5 = st.text_input('5.你有什么得意的编程作品吗？', '') + '\n'

q6 = st.text_input('6.你还希望能用编程做些什么', '') + '\n'

if st.button('提交'):
    if d[name] == password:
        with open('./my_text/'+name+'.txt', 'a', encoding='utf-8') as f:
            f.write(q1+q2+q3+q4+q5+q6)
        st.toast('提交成功！')
        st.balloons()
        st.empty()
    else:
        st.toast('名字或密码错误！')